Долома/src/Catalogs/РодословнаяЖивотных/РодословнаяЖивотных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РодословнаяЖивотных</name>
  <attributes>
    <name>Отец</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Мать</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолЖивотного</types>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейнаяПринадлежность</name>
    <type>
      <types>CatalogRef.Линии</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Породность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйКласс</name>
    <type>
      <types>CatalogRef.КомплексныеКлассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Масть</name>
    <type>
      <types>CatalogRef.Масти</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БиркаХорриот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/InformationRegisters/РодственныеСвязи/РодственныеСвязи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РодственныеСвязи</name>
  <resources>
    <name>Ряд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РядРимскими</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Животное</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предок</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Долома/src/Catalogs/БыкиПлеменные/БыкиПлеменные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БыкиПлеменные</name>
  <predefined>
    <items>
      <name>НеопределенныйОтец</name>
      <description>Неопределенный отец</description>
    </items>
  </predefined>
  <attributes>
    <name>КодСемени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаботает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивное</name>
    <comment>Элемент находится в архиве. Учет по животному НЕ ведется.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КличкаНаЛатинице</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БетаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаппаКазеин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнаяКличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родословная</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/Catalogs/Животные/Животные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Животные</name>
  <comment>Данные о животных в стаде(ах)</comment>
  <predefined>
    <items>
      <name>НеопределеннаяМать</name>
      <description>Неопределенная мать</description>
    </items>
  </predefined>
  <attributes>
    <name>Бирка</name>
    <comment>Уникальный номер бирки животного (уникальный номер животного)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БиркаХорриот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кличка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Родословная</name>
    <type>
      <types>CatalogRef.РодословнаяЖивотных</types>
    </type>
  </attributes>
</mdclass:Catalog>

Долома/src/Catalogs/РодословнаяЖивотных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СформироватьДеревоСвязей();
		Животное = НайтиЖивотное(Объект.Ссылка);
		ЖивотноеСтарое = Животное;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Животное <> ЖивотноеСтарое Тогда
		Если ЗначениеЗаполнено(ЖивотноеСтарое) Тогда
			ЖивотноеСтароеОбъект = ЖивотноеСтарое.ПолучитьОбъект();
			ЖивотноеСтароеОбъект.Родословная = Справочники.РодословнаяЖивотных.ПустаяСсылка();
		    ЖивотноеСтароеОбъект.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Животное) Тогда
			ЖивотноеОбъект = Животное.ПолучитьОбъект();
			ЖивотноеОбъект.Родословная = Объект.Ссылка;
		    ЖивотноеОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЖивотноеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРодственныхСвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоРодственныхСвязей.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Предок) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КличкаПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура СоздатьБыка(Команда)
	
	СтруктураЗаполнения = Новый Структура(); 
	
	СтруктураЗаполнения.Вставить("Наименование",	Объект.Наименование); 
	СтруктураЗаполнения.Вставить("Кличка", 			Объект.Кличка); 
	СтруктураЗаполнения.Вставить("КодСемени", 		Объект.КодСемени); 
	СтруктураЗаполнения.Вставить("ДатаРождения", 	Объект.ДатаРождения);
	СтруктураЗаполнения.Вставить("Порода", 			Объект.Порода);
	СтруктураЗаполнения.Вставить("ПолнаяКличка", 	Объект.КличкаНаАнглийском);
	СтруктураЗаполнения.Вставить("Родословная", 	Объект.Ссылка);
	СтруктураЗаполнения.Вставить("БетаКазеин", 		Объект.БетаКазеин);
	СтруктураЗаполнения.Вставить("КаппаКазеин", 	Объект.КаппаКазеин);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения);
	ОткрытьФорму("Справочник.БыкиПлеменные.ФормаОбъекта", ПараметрыФормы); 

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФукции

&НаСервереБезКонтекста
Функция НайтиЖивотное(Родословная)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Животные.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Животные КАК Животные
	|ГДЕ
	|	Животные.Родословная = &Родословная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БыкиПлеменные.Ссылка
	|ИЗ
	|	Справочник.БыкиПлеменные КАК БыкиПлеменные
	|ГДЕ
	|	БыкиПлеменные.Родословная = &Родословная";
	Запрос.УстановитьПараметр("Родословная",Родословная);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка; 
	КонецЕсли;		
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНаименование() 
	
	Объект.Наименование = ОбщегоНазначенияКлиент.ПолучитьНаименованиеРодословной(Объект);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.СоздатьБыка.Видимость = НЕ ЗначениеЗаполнено(Животное);
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоСвязей()

	ДеревоСвязей = РегистрыСведений.РодственныеСвязи.СформироватьДеревоСвязей(Объект.Ссылка);
	ЗначениеВДанныеФормы(ДеревоСвязей, ДеревоРодственныхСвязей);

КонецПроцедуры
	
#КонецОбласти
